cf/InformationRegisters/ОтказанныеНовости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОтказанныеНовости</Name>
			<Comment>Новости которые пользователь выбрать что их больше не показывать</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Новость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Новость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/HTMLОбработкаСервер/Ext/Module.bsl
Функция ИзменитьСпособОтображенияьНовости(ГуидСтрока, Отказ, ГуидПользователя) Экспорт
	
	НовостьСсылка = Документы.Новость.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидСтрока));
	
	Если НовостьСсылка.ПолучитьОбъект().Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НовЗапись = РегистрыСведений.ОтказанныеНовости.СоздатьМенеджерЗаписи();
	
	НовЗапись.Новость 		= НовостьСсылка;
	НовЗапись.Пользователь 	= Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидПользователя));
	НовЗапись.Период 		= ТекущаяДата();
	НовЗапись.Отказ 		= Отказ;
	
	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовЗапись);
	
КонецФункции

Функция ПолучитьОбъектПоГуидСтроке(Менеджер, СтрокаГуид) Экспорт
	
	Возврат Вычислить(Менеджер).ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаГуид));
	
КонецФункции
